<?xml version="1.0" ?>
<net name="torch-jit-export" version="11">
	<layers>
		<layer id="201" name="input" type="Parameter" version="opset1">
			<data shape="1,3,8,224,224" element_type="f32"/>
			<rt_info>
				<attribute name="old_api_map_element_type" version="0" value="f16"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="input">
					<dim>1</dim>
					<dim>3</dim>
					<dim>8</dim>
					<dim>224</dim>
					<dim>224</dim>
					<rt_info>
						<attribute name="layout" version="0" layout="[N,C,D,H,W]"/>
					</rt_info>
				</port>
			</output>
		</layer>
		<layer id="0" name="4102410614680" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="1" name="4103410714263" type="Const" version="opset1">
			<data offset="4" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="2" name="4104410814122" type="Const" version="opset1">
			<data offset="0" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="3" name="4105410914089" type="Const" version="opset1">
			<data offset="4" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="4" name="2857286114815" type="Const" version="opset1">
			<data offset="8" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="5" name="2858286215631" type="Const" version="opset1">
			<data offset="12" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="6" name="2859286315595" type="Const" version="opset1">
			<data offset="8" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="7" name="2860286414929" type="Const" version="opset1">
			<data offset="12" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="8" name="Constant_25193514623" type="Const" version="opset1">
			<data offset="16" size="16" shape="2" element_type="i64"/>
			<output>
				<port id="0" precision="I64" names="671">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="4082408614734" type="Const" version="opset1">
			<data offset="32" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="10" name="4083408715784" type="Const" version="opset1">
			<data offset="36" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="11" name="4084408814743" type="Const" version="opset1">
			<data offset="32" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="12" name="4085408915274" type="Const" version="opset1">
			<data offset="36" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="13" name="2407241114893" type="Const" version="opset1">
			<data offset="40" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="14" name="2408241214836" type="Const" version="opset1">
			<data offset="44" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="15" name="2409241314155" type="Const" version="opset1">
			<data offset="40" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="16" name="2410241415658" type="Const" version="opset1">
			<data offset="44" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="17" name="3017302115646" type="Const" version="opset1">
			<data offset="48" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="18" name="3018302214137" type="Const" version="opset1">
			<data offset="52" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="19" name="3019302315076" type="Const" version="opset1">
			<data offset="48" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="20" name="3020302415331" type="Const" version="opset1">
			<data offset="52" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="21" name="2787279115766" type="Const" version="opset1">
			<data offset="56" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="22" name="2788279214704" type="Const" version="opset1">
			<data offset="60" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="23" name="2789279315124" type="Const" version="opset1">
			<data offset="56" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="24" name="2790279415802" type="Const" version="opset1">
			<data offset="60" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="25" name="2547255114236" type="Const" version="opset1">
			<data offset="64" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="26" name="2548255215019" type="Const" version="opset1">
			<data offset="68" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="27" name="2549255314992" type="Const" version="opset1">
			<data offset="64" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="28" name="2550255414095" type="Const" version="opset1">
			<data offset="68" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="29" name="1537154114512" type="Const" version="opset1">
			<data offset="72" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="30" name="1538154214515" type="Const" version="opset1">
			<data offset="76" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="31" name="1539154315310" type="Const" version="opset1">
			<data offset="72" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="32" name="1540154414806" type="Const" version="opset1">
			<data offset="76" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="33" name="1997200115427" type="Const" version="opset1">
			<data offset="8" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="34" name="1998200214446" type="Const" version="opset1">
			<data offset="80" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="35" name="1999200314557" type="Const" version="opset1">
			<data offset="8" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="36" name="2000200415241" type="Const" version="opset1">
			<data offset="80" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="37" name="1517152115379" type="Const" version="opset1">
			<data offset="8" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="38" name="1518152214167" type="Const" version="opset1">
			<data offset="84" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="39" name="1519152315421" type="Const" version="opset1">
			<data offset="8" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="40" name="1520152415796" type="Const" version="opset1">
			<data offset="84" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="41" name="2807281114230" type="Const" version="opset1">
			<data offset="88" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="42" name="2808281215505" type="Const" version="opset1">
			<data offset="92" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="43" name="2809281314914" type="Const" version="opset1">
			<data offset="88" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="44" name="2810281415268" type="Const" version="opset1">
			<data offset="92" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="45" name="3027303115511" type="Const" version="opset1">
			<data offset="96" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="46" name="3028303215049" type="Const" version="opset1">
			<data offset="100" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="47" name="3029303315571" type="Const" version="opset1">
			<data offset="96" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="48" name="3030303414671" type="Const" version="opset1">
			<data offset="100" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="49" name="2587259114791" type="Const" version="opset1">
			<data offset="104" size="2688" shape="1,672,1,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>672</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="2588259214422" type="Const" version="opset1">
			<data offset="2792" size="2688" shape="1,672,1,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>672</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="2589259315052" type="Const" version="opset1">
			<data offset="104" size="2688" shape="1,672,1,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>672</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="2590259414485" type="Const" version="opset1">
			<data offset="2792" size="2688" shape="1,672,1,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>672</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="3037304115175" type="Const" version="opset1">
			<data offset="5480" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="54" name="3038304215109" type="Const" version="opset1">
			<data offset="5484" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="55" name="3039304314188" type="Const" version="opset1">
			<data offset="5480" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="56" name="3040304414416" type="Const" version="opset1">
			<data offset="5484" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="57" name="1497150114593" type="Const" version="opset1">
			<data offset="5488" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="58" name="1498150214692" type="Const" version="opset1">
			<data offset="5492" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="59" name="1499150315610" type="Const" version="opset1">
			<data offset="5488" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="60" name="1500150414599" type="Const" version="opset1">
			<data offset="5492" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="61" name="3137314115370" type="Const" version="opset1">
			<data offset="8" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="62" name="3138314215118" type="Const" version="opset1">
			<data offset="5496" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="63" name="3139314315547" type="Const" version="opset1">
			<data offset="8" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="64" name="3140314414110" type="Const" version="opset1">
			<data offset="5496" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="65" name="1697170114158" type="Const" version="opset1">
			<data offset="8" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="66" name="1698170215781" type="Const" version="opset1">
			<data offset="5500" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="67" name="1699170315070" type="Const" version="opset1">
			<data offset="8" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="68" name="1700170415613" type="Const" version="opset1">
			<data offset="5500" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="69" name="3157316114785" type="Const" version="opset1">
			<data offset="5504" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="70" name="3158316214398" type="Const" version="opset1">
			<data offset="5508" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="71" name="3159316314842" type="Const" version="opset1">
			<data offset="5504" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="72" name="3160316415007" type="Const" version="opset1">
			<data offset="5508" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="73" name="1717172115244" type="Const" version="opset1">
			<data offset="5512" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="74" name="1718172214491" type="Const" version="opset1">
			<data offset="5516" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="75" name="1719172314425" type="Const" version="opset1">
			<data offset="5512" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="76" name="1720172414569" type="Const" version="opset1">
			<data offset="5516" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="77" name="1867187115466" type="Const" version="opset1">
			<data offset="5520" size="2688" shape="1,672,1,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>672</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="1868187215559" type="Const" version="opset1">
			<data offset="8208" size="2688" shape="1,672,1,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>672</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="1869187315682" type="Const" version="opset1">
			<data offset="5520" size="2688" shape="1,672,1,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>672</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="1870187414464" type="Const" version="opset1">
			<data offset="8208" size="2688" shape="1,672,1,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>672</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="2427243115526" type="Const" version="opset1">
			<data offset="10896" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="82" name="2428243214377" type="Const" version="opset1">
			<data offset="10900" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="83" name="2429243315757" type="Const" version="opset1">
			<data offset="10896" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="84" name="2430243415115" type="Const" version="opset1">
			<data offset="10900" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="85" name="1577158114953" type="Const" version="opset1">
			<data offset="10904" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="86" name="1578158214125" type="Const" version="opset1">
			<data offset="10908" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="87" name="1579158314482" type="Const" version="opset1">
			<data offset="10904" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="88" name="1580158415313" type="Const" version="opset1">
			<data offset="10908" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="89" name="2947295114965" type="Const" version="opset1">
			<data offset="10912" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="90" name="2948295215463" type="Const" version="opset1">
			<data offset="10916" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="91" name="2949295314386" type="Const" version="opset1">
			<data offset="10912" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="92" name="2950295415577" type="Const" version="opset1">
			<data offset="10916" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="93" name="2507251115316" type="Const" version="opset1">
			<data offset="8" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="94" name="2508251214542" type="Const" version="opset1">
			<data offset="10920" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="95" name="2509251314299" type="Const" version="opset1">
			<data offset="8" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="96" name="2510251415178" type="Const" version="opset1">
			<data offset="10920" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="97" name="2927293115739" type="Const" version="opset1">
			<data offset="8" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="98" name="2928293214710" type="Const" version="opset1">
			<data offset="10924" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="99" name="2929293314998" type="Const" version="opset1">
			<data offset="8" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="100" name="2930293414305" type="Const" version="opset1">
			<data offset="10924" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="101" name="2527253115775" type="Const" version="opset1">
			<data offset="10928" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="102" name="2528253215334" type="Const" version="opset1">
			<data offset="10932" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="103" name="2529253314086" type="Const" version="opset1">
			<data offset="10928" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="104" name="2530253414098" type="Const" version="opset1">
			<data offset="10932" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="105" name="3007301114647" type="Const" version="opset1">
			<data offset="10936" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="106" name="3008301214773" type="Const" version="opset1">
			<data offset="10940" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="107" name="3009301315199" type="Const" version="opset1">
			<data offset="10936" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="108" name="3010301414926" type="Const" version="opset1">
			<data offset="10940" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="109" name="1827183115424" type="Const" version="opset1">
			<data offset="10944" size="1920" shape="1,480,1,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>480</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="1828183214200" type="Const" version="opset1">
			<data offset="12864" size="1920" shape="1,480,1,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>480</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="1829183315736" type="Const" version="opset1">
			<data offset="10944" size="1920" shape="1,480,1,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>480</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="1830183415391" type="Const" version="opset1">
			<data offset="12864" size="1920" shape="1,480,1,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>480</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="2367237114269" type="Const" version="opset1">
			<data offset="14784" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="114" name="2368237214209" type="Const" version="opset1">
			<data offset="14788" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="115" name="2369237314590" type="Const" version="opset1">
			<data offset="14784" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="116" name="2370237414803" type="Const" version="opset1">
			<data offset="14788" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="117" name="2097210114326" type="Const" version="opset1">
			<data offset="14792" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="118" name="2098210214629" type="Const" version="opset1">
			<data offset="14796" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="119" name="2099210314518" type="Const" version="opset1">
			<data offset="14792" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="120" name="2100210415592" type="Const" version="opset1">
			<data offset="14796" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="121" name="1887189114536" type="Const" version="opset1">
			<data offset="14800" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="122" name="1888189215457" type="Const" version="opset1">
			<data offset="14804" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="123" name="1889189315529" type="Const" version="opset1">
			<data offset="14800" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="124" name="1890189414128" type="Const" version="opset1">
			<data offset="14804" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="125" name="1657166115502" type="Const" version="opset1">
			<data offset="14808" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="126" name="1658166215103" type="Const" version="opset1">
			<data offset="14812" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="127" name="1659166314452" type="Const" version="opset1">
			<data offset="14808" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="128" name="1660166415769" type="Const" version="opset1">
			<data offset="14812" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="129" name="1757176115598" type="Const" version="opset1">
			<data offset="14816" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="130" name="1758176215250" type="Const" version="opset1">
			<data offset="14820" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="131" name="1759176315655" type="Const" version="opset1">
			<data offset="14816" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="132" name="1760176414917" type="Const" version="opset1">
			<data offset="14820" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="133" name="1957196115181" type="Const" version="opset1">
			<data offset="14824" size="960" shape="1,240,1,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>240</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="134" name="1958196214182" type="Const" version="opset1">
			<data offset="15784" size="960" shape="1,240,1,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>240</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="135" name="1959196314962" type="Const" version="opset1">
			<data offset="14824" size="960" shape="1,240,1,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>240</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="136" name="1960196415724" type="Const" version="opset1">
			<data offset="15784" size="960" shape="1,240,1,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>240</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="137" name="2157216115259" type="Const" version="opset1">
			<data offset="16744" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="138" name="2158216214776" type="Const" version="opset1">
			<data offset="16748" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="139" name="2159216314467" type="Const" version="opset1">
			<data offset="16744" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="140" name="2160216415340" type="Const" version="opset1">
			<data offset="16748" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="141" name="2077208115025" type="Const" version="opset1">
			<data offset="16752" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="142" name="2078208215286" type="Const" version="opset1">
			<data offset="16756" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="143" name="2079208314461" type="Const" version="opset1">
			<data offset="16752" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="144" name="2080208414626" type="Const" version="opset1">
			<data offset="16756" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="145" name="2677268115652" type="Const" version="opset1">
			<data offset="16760" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="146" name="2678268214632" type="Const" version="opset1">
			<data offset="16764" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="147" name="2679268314662" type="Const" version="opset1">
			<data offset="16760" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="148" name="2680268414419" type="Const" version="opset1">
			<data offset="16764" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="149" name="2387239115385" type="Const" version="opset1">
			<data offset="8" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="150" name="2388239214650" type="Const" version="opset1">
			<data offset="16768" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="151" name="2389239314428" type="Const" version="opset1">
			<data offset="8" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="152" name="2390239414458" type="Const" version="opset1">
			<data offset="16768" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="153" name="2967297114278" type="Const" version="opset1">
			<data offset="8" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="154" name="2968297214983" type="Const" version="opset1">
			<data offset="16772" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="155" name="2969297314479" type="Const" version="opset1">
			<data offset="8" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="156" name="2970297414374" type="Const" version="opset1">
			<data offset="16772" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="157" name="3217322114212" type="Const" version="opset1">
			<data offset="8" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="158" name="3218322215667" type="Const" version="opset1">
			<data offset="16776" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="159" name="3219322315082" type="Const" version="opset1">
			<data offset="8" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="160" name="3220322415361" type="Const" version="opset1">
			<data offset="16776" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="161" name="2827283115550" type="Const" version="opset1">
			<data offset="16780" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="162" name="2828283214938" type="Const" version="opset1">
			<data offset="16784" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="163" name="2829283315061" type="Const" version="opset1">
			<data offset="16780" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="164" name="2830283414359" type="Const" version="opset1">
			<data offset="16784" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="165" name="2667267115793" type="Const" version="opset1">
			<data offset="16788" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="166" name="2668267215043" type="Const" version="opset1">
			<data offset="16792" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="167" name="2669267314497" type="Const" version="opset1">
			<data offset="16788" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="168" name="2670267414566" type="Const" version="opset1">
			<data offset="16792" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="169" name="1637164115733" type="Const" version="opset1">
			<data offset="16796" size="288" shape="1,72,1,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="170" name="1638164215772" type="Const" version="opset1">
			<data offset="17084" size="288" shape="1,72,1,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="171" name="1639164315121" type="Const" version="opset1">
			<data offset="16796" size="288" shape="1,72,1,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="172" name="1640164415079" type="Const" version="opset1">
			<data offset="17084" size="288" shape="1,72,1,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="173" name="2137214115073" type="Const" version="opset1">
			<data offset="17372" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="174" name="2138214214449" type="Const" version="opset1">
			<data offset="17376" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="175" name="2139214314281" type="Const" version="opset1">
			<data offset="17372" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="176" name="2140214415487" type="Const" version="opset1">
			<data offset="17376" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="177" name="1597160114584" type="Const" version="opset1">
			<data offset="17380" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="178" name="1598160215235" type="Const" version="opset1">
			<data offset="17384" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="179" name="1599160315469" type="Const" version="opset1">
			<data offset="17380" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="180" name="1600160414152" type="Const" version="opset1">
			<data offset="17384" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="181" name="1797180115187" type="Const" version="opset1">
			<data offset="17388" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="182" name="1798180215760" type="Const" version="opset1">
			<data offset="17392" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="183" name="1799180314146" type="Const" version="opset1">
			<data offset="17388" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="184" name="1800180415406" type="Const" version="opset1">
			<data offset="17392" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="185" name="2017202114977" type="Const" version="opset1">
			<data offset="8" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="186" name="2018202214521" type="Const" version="opset1">
			<data offset="17396" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="187" name="2019202315691" type="Const" version="opset1">
			<data offset="8" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="188" name="2020202414104" type="Const" version="opset1">
			<data offset="17396" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="189" name="1677168115544" type="Const" version="opset1">
			<data offset="17400" size="256" shape="1,64,1,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="190" name="1678168215553" type="Const" version="opset1">
			<data offset="17656" size="256" shape="1,64,1,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="191" name="1679168315304" type="Const" version="opset1">
			<data offset="17400" size="256" shape="1,64,1,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="192" name="1680168414857" type="Const" version="opset1">
			<data offset="17656" size="256" shape="1,64,1,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="193" name="2187219114074" type="Const" version="opset1">
			<data offset="17912" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="194" name="2188219215280" type="Const" version="opset1">
			<data offset="17916" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="195" name="2189219315253" type="Const" version="opset1">
			<data offset="17912" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="196" name="2190219415223" type="Const" version="opset1">
			<data offset="17916" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="197" name="2327233115094" type="Const" version="opset1">
			<data offset="17920" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="198" name="2328233214854" type="Const" version="opset1">
			<data offset="17924" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="199" name="2329233315328" type="Const" version="opset1">
			<data offset="17920" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="200" name="2330233414440" type="Const" version="opset1">
			<data offset="17924" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="202" name="Constant_175848115238" type="Const" version="opset1">
			<data offset="17928" size="6" shape="1,3,1,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="203" name="Constant_17584817994/restored_convert" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="204" name="Subtract_1759" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="preprocessing" version="0"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>8</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>8</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="205" name="Conv_0/WithoutBiases/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>8</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>8</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="206" name="Conv_0/WithoutBiases/fq_weights_1/scale1076015607" type="Const" version="opset1">
			<data offset="17934" size="64" shape="16,1,1,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="207" name="Constant_43264847995/restored_convert/quantized1075214674" type="Const" version="opset1">
			<data offset="17998" size="432" shape="16,3,1,3,3" element_type="i8"/>
			<output>
				<port id="0" precision="I8">
					<dim>16</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="208" name="Constant_43264847995/restored_convert/quantized/to_f32" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<input>
				<port id="0">
					<dim>16</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="209" name="Conv_0/WithoutBiases/fq_weights_1/mulpiply_by_scale" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>16</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>16</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="210" name="Conv_0/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,2,2" dilations="1,1,1" pads_begin="0,1,1" pads_end="0,1,1"/>
			<rt_info>
				<attribute name="preprocessing" version="0"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>8</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
				<port id="1">
					<dim>16</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>8</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="211" name="Reshape_16848714329" type="Const" version="opset1">
			<data offset="18430" size="32" shape="1,16,1,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="212" name="Reshape_1684877996/restored_convert" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="213" name="Conv_0" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>8</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
